/**
 * 변수 : 데이터 1개를 저장할 수 있는 공간 / let 변수명 = 데이터
 * 상수 : 데이터 1개를 저장할 수 있는 공간	/const 변수명 = 데이터
 * 		선원키워드 변수명 = 저장할 데이터
 * 배열 : 데이터 여러개를 한 곳에 저장할 수 있는 공간 / 메모리 /상자 
 * 		- 저장된 순서 / 나열된 순서대로 번호가 매겨진 데이터들의 연속적인 형태
 * 		- 순서대로 번호 = 인덱스 **
 * 		- 인덱스 순으로 데이터들을 연속적으로 저장
 * 		1. 배열 : [ 대괄호] 사용
 * 		2. 식별번호 : 인덱스 사용 [ 0번부터 시작~]
 * 		3. 배열의 선언
 * 			let 배열 = [데이터1, 데이터2, 데이터3 ]
 *			const 배열 = [데이터1. 데이터2, 데이터3 ]
 			ex) 
 				let 청소부 = '하하' 
 					=> 청소부 이라는 변수명에 1개의 데이터를 저장했다. (변수)
 				let무궁화반 = ['유재석', '강호동', '신동엽', '서장훈']
 					=> '무궁화반' 이라는 변수명에 4명/개의 데이터를 저장했다.(배열)
 */	

 //1. 배열선언
 let 배열명 = ['바나나', '사과', '딸기', '포도'] // 
 //2. 배열호출
 console.log(배열명) // Array(4) -> 클릭하면 인덱스 : 데이터 식으로 0:바나나 ... length:4출력됨
 document.write(배열명) //html에 출력 바나나~ 포도
 //3. 인덱스 사용
 console.log(배열명[0])
 document.write('<h3> 과일개수 :'+배열명.length+'</h3>')
 document.write('<ol>')
 document.write('<li>'+배열명[0]+'</li>')
 document.write('<li>'+배열명[1]+'</li>')
 document.write('<li>'+배열명[2]+'</li>')
 document.write('<li>'+배열명[3]+'</li>')
 document.write('</ol>') 
 //예제4 : 인덱스를 이용한 데이터 수정
 console.log( '수정전 : '+ 배열명[0])
 배열명[0] = '수박'
 console.log('수정후 : '+배열명[0])
 
 //예제 5 : 배열에 요소 / 데이터 추가
 배열명.push('체리') // 마지막 인덱스로 새로운 데이터 추가
 console.log(배열명) 
 배열명.splice(2,0,'복숭아') //2번째 인덱스에 0개를 자르고 복숭아 저장
 //2번째 인덱스자리에 복숭아 데이터 삽입
 console.log('2번째 인덱스에 0개를 자르고 복숭아 저장  : '+배열명) 
 
 
 //예제6 : 배열 특정 요소 /데이터 삭제
 배열명.splice(0,1) //0인덱스부터 1개 삭제
 console.log('수박제거 : '+배열명) //수박제거ㅏ
 
 배열명.splice(배열명.indexOf('딸기'),1) // '딸기의 인덱스를 모르는 상태에서 딸기의 인덱스를 구하고 삭제'
console.log('딸기삭제  :'+배열명);