package 과제.과제1;

public class 과제1 {

}
/*
 * [ 연산자]
 * 1. 산술연산자 : + - * / %
 * 2. 연결연산자 : +
   3. 논리연산자 && || !  
 * 4. 비교연산자 < > <= >= != ==
 * 5. 증감연산자 ++ -- 후위 / 선위
 * 6. 삼항연산: 조건? 참: 거짓  / 조건1?조건2:참2:거짓2:거짓
 * 7. 대입연산자: = , +=, -=, *=, /=, %=
 */

/* 1. 4번
 * 2. 2~ 7번 (1번빼고)
 * 3. 왼쪽부터 byte / boolean) (short/char) (int / float) ( long / double)
 * 4. int, double / age price / 10 3.14
 * 5. 3번
 * 6. 4번
 * 7. 3번, 6번
 * 8. 4번
 * 9. 1번
 * 10.2번
 * 11. line : 13, 16
 */