/**
 *    
 * [ JS 연산자 과제1 ]
   문제11 : 정수 3개를 입력받아 오름차순 으로 출력    [ 7 5 9 -> 5 7 9]
   문제12 : [ 가위바위보 게임 ] 
   - 가위가 '0' 이고 바위가 '1' 이고 보가 '2' 일때 플레이어1와 플레이어2 가 있습니다. 
   - 승리자 판단과 무승부 경우의수를 출력하시오.
   [입력]
      플레이어1가 0 혹은 1 혹은 2 입력받아 변수에 저장합니다.
      플레이어2가 0 혹은 1 혹은 2 입력받아 변수에 저장합니다.
   [경우의수 판단]
      플레이어1 이겼을때 경우의수 ' 플레이어1 승리 ' 출력
      플레이어2 이겼을때 경우의수 ' 플레이어2 승리 ' 출력
      비겼을경우 '무승부' 출력
 */
//문제11
let a11 = Number(prompt('첫번째 정수를 입력하세요'))
let b11 = Number(prompt('두번째 정수를 입력하세요'))
let c11 = Number(prompt('세번째 정수를 입력하세요')) 
let max11 = a11 > b11 && a11 > c11 ? a11 :
 		  	b11 > a11 && b11 > c11 ? b11 : c11
let min11 = a11 < b11 && a11 < c11 ? a11 :
 		  	b11 < a11 && b11 < c11 ? b11 : c11 	
let mid11 = max11 == a11 && min11 == b11 ? c11 :
			max11 == a11 && min11 == c11 ? b11 :
			max11 == b11 && min11 == a11 ? c11 :
			max11 == b11 && min11 == c11 ? a11 :
			max11 == c11 && min11 == a11 ? b11 :a11
console.log('세 정수의 오름차순으로 정렬하면 ' + min11 + '/'+ mid11 +'/'+max11)			

//문제 12
let player1 = prompt('가위는 0 / 바위는 1 / 보는 2 입니다')
let player2 = prompt('가위는 0 / 바위는 1 / 보는 2 입니다')

let result =	player1 == '0' && player2 == '0' ? '무승부': // 가위 = 가위
			  	player1 == '0' && player2 == '1' ? '플레이어 2 승리 !': //가위 < 바위 
			  	player1 == '0' && player2 == '2' ? '플레이어 1 승리 !': //가위 > 보
			  	player1 == '1' && player2 == '0' ? '플레이어 1 승리 !': // 바위 > 가위
			  	player1 == '1' && player2 == '1' ? '무승부':			//바위 = 바위
			  	player1 == '1' && player2 == '2' ? '플레이어 2 승리 !':	//바위 <보
			  	player1 == '2' && player2 == '0' ? '플레이어 2 승리 !': //보 <가위
			  	player1 == '2' && player2 == '1' ? '플레이어 1 승리 !': '무승부'  //보 >바위
			  	
console.log("플레이어 1 : "+player1+" | 플레이어 2:"+player2 + "| 가위바위보 결과 :" + result)			  				  
			  	
			  	